log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** GHC Cross Compiler Binary Distributions
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-10-20-ghc-cross-compiler-binary-distributions
   :EXPORT_DATE: <2017-10-20>
   :ID:       112673BE-4DB3-431E-A69C-CBD1151E4905
   :END:

As mentioned in the September Edition of
[[https://medium.com/@zw3rk/what-is-new-in-cross-compiling-haskell-976cd4752bb9][What
is New in Cross Compiling Haskell]], I've been working on producing
binary distributions of cross compilers, so that installing a cross
compiler becomes almost as trivial as installing a GHC binary
distribution.

A word of caution is in order. /These are rather experimental builds,
and realistically I expect there to be a few issues, that will arise.
I'd still appreciate early feedback so that we can iron out the wrinkles
quickly!/

I've build binary distributions for from /macOS Sierra/ to /iOS,
Android/ and /Raspberry Pi/, as well as binary distributions from
/Debian 8/ to /Android/ and /Raspberry Pi/.

So head on over to
[[http://hackage.mobilehaskell.org][hackage.mobilehaskell.org]] and grab
the binary distribution of your choice.

*** Prerequisites
    :PROPERTIES:
    :ID:       4CEA3B94-374C-4E51-AD8A-F4E443798F65
    :END:

For iOS development, the iOS SDK that is shipped with Xcode is required.
For Android you will need the Android NDK, and
[[https://medium.com/@zw3rk/building-iconv-for-android-e3581a52668f][iconv
for Android]]. For Raspberry Pi, you will need to creat the
[[https://medium.com/@zw3rk/making-a-raspbian-cross-compilation-sdk-830fe56d75ba][Raspbian
SDK]].

You will also need a copy of LLVM5 in =PATH=. As well as a copy of the
bootstrapped toolchain wrapper.

#+BEGIN_EXAMPLE
  $ git clone https://github.com/zw3rk/toolchain-wrapper.git
  $ cd toolchain-wrapper
  toolchain-wrapper $ ./bootstrap
  $ export PATH="$(PWD)/toolchain-wrapper:$PATH"
#+END_EXAMPLE

Note: /you may need to adjust the/ =*-toolchain.config= /file to match
your toolchain paths./

*** Installing the binary distribution
    :PROPERTIES:
    :ID:       CE6783DA-5CFD-4A44-8ED8-2F4022DDC5A1
    :END:

While I hope that installing the binary distributions will eventually be
as simple as =./configure --prefix=... && make install= for now you will
likely need to provide =--target=... --host=... --build=...= as well.
E.g. for the =aarch64-unknown-linux-android= on Debian 8, you would
provide:

#+BEGIN_EXAMPLE
  ./configure --prefix=... \
              --target=aarch64-linux-android \
              --host=x86_64-pc-linux-gnu \
              --build=x86_64-pc-linux-gnu
  make install
#+END_EXAMPLE

to satisfy the =configure= script.

*** Where to go from here
    :PROPERTIES:
    :ID:       5B7380BB-4ECF-4651-9AF8-12ABC7A46C79
    :END:

You should now be able to compile a simple

#+BEGIN_EXAMPLE
  main = putStrLn "Hello World"
#+END_EXAMPLE

haskell file with your =<target>-ghc= for your target. Note that for iOS
and Android you would likely want to use =-staticlib= to produce a
static archive to link with your application.

*** Bugs & Issues
    :PROPERTIES:
    :ID:       1678AF12-83D7-4257-9962-2EE24A3A09BD
    :END:

Please file any bug and issues you run into with the
[[https://github.com/mobilehaskell/hackage-overlay/issues][hackage-overlay]]
issue tracker. That way we will have a central issue and knowledge base.

